# Будь-який текст від символу "#" до кінця рядка - це коментар
# Коментарі ігноруються під час виконання програми

# print – це функція, яка виводить інформацію на екран
# параметри (аргументи) функцій беруться у круглі дужки
# "Hello, World!" — це рядок, який ми виводимо

print("Hello, World!")

# Рядки можна обрамляти в одинарні лапки - результат не зміниться
print('Hello, World!')

'''
    Це багаторядковий коментар
'''

"""
    Це docstring функції/класу
"""

###

# Функція print може приймати кілька параметрів, коли ми передаємо кілька значень
# у функцію, то вони поділяються комами

print(1, 57, 15, 21, 1545)
print("first", "second")

# Виконання конкатенації
print("first" + "second")
print(1 + 2)
print()
print('Разом до оплати:', 5 * 17, 'грн.')

###

# Використання функції print() без параметрів
print()

# Виведення на екран числа
print(57)

# Виведення на екран результату додавання
print(1254 + 9123)

# Виведення на екран результат віднімання
print(102983091284098 - 71284828)

# Виведення на екран результату множення
print(3 * 16)

# Виведення на екран результату додавання
print(96 / 2)

# Виведення на екран результату множення
print(7 * 7 * 7 * 7 * 7 * 7 * 7 * 7 * 7)

# Виведення на екран результату зведення числа в ступінь
print(7 ** 9)

# Виведення на екран цілого від поділу
print(21 // 8)

# Виведення на екран залишку від розподілу
print(21 % 8)

###

# Створимо змінну name (змінні докладно # розглядаються у наступному уроці)
# Змінній name ми присвоюємо значення 'Alex'
name = "Alex"
age = 14
info = 'Qwerty'
print(type(info))

# Після цього можна звертатися до цього значення на ім'я
print(name)
print(age)
print(info)
info = 15
print(type(info))
print(info)

###

# input() — функція, яка зупиняє виконання програми,
# поки користувач не введе значення та натисне клавішу Enter.
# Функція повертає введене значення у типу данних рядок.

text = input("Enter some text: ")
print(text)