"""
Обчислення із змінними
Замість обчислення з фактичними значеннями, ви можете використовувати змінні.

Скільки грошей ви заощадите через чотири місяці, якщо щомісяця заощаджуватимете 10 доларів?

Створіть змінну monthly_savings, рівну 10, та num_months, рівну 4.
Помножте monthly_savings на num_months і присвойте результат new_savings.

"""
# Створіть змінну monthly_savings, рівну 10, та num_months, рівну 4


# Помножте monthly_savings на num_months і збережіть результат в змінну new_savings

# Виведіть new_savings
