"""
Завдання 1

Створіть клас Editor, який містить методи view_document та edit_document. 
Нехай метод edit_document виводить на екран інформацію про те, що редагування документів недоступне для безкоштовної версії. 
Створіть підклас ProEditor, у якому цей метод буде перевизначено. 
Введіть ліцензійний ключ із клавіатури і, якщо він коректний, створіть екземпляр класу ProEditor, інакше Editor.
Викликайте методи перегляду та редагування документів.

# Завдання 1.1

# Створіть ієрархію класів із використанням множинного успадкування. 
# Виведіть на екран порядок вирішення методів для кожного класу. 
# Поясніть, чому лінеаризація даних класів виглядає саме так.

Завдання 2
На підставі MyClass1
створіть декоратор @staticmethod для визначення повноліття людини в Україні та Америки.

Завдання 3
На підставі MyClass1
створіть декоратори @classmethod для формування переліку об'єктів, які підрахують кількість повнолітніх людей в Україні та Америці.

# Завдання 3.1 

# Створіть ієрархію класів транспортних засобів. 
# У загальному класі опишіть загальні всім транспортних засобів поля, 
# у спадкоємцях – специфічні їм. 
# Створіть кілька екземплярів. 
# Виведіть інформацію щодо кожного транспортного засобу.
"""