"""
Завдання 0
Створіть клас "Студент" з атрибутами "ім'я", "прізвище", "вік" та "середній бал".
Створіть об'єкт цього класу, представляючи студента. Потім додайте метод до класу "Студент",
який дозволяє змінювати середній бал студента. Виведіть інформацію про студента та змініть
його середній бал.

Завдання 1
Створіть клас, який описує книгу. Він повинен містити інформацію про автора, назву, рік видання та
жанр. Створіть кілька різних книжок. Визначте для нього методи __repr__ та __str__.

Завдання 2
Створіть клас, який описує відгук до книги. Додайте до класу книги поле(атрибут) – список_відгуків. Зробіть так,
щоб при виведенні обєкту классу книги на екран за допомогою функції print (__str__) також виводилися відгуки до неї.
"""