"""
Завдання 1 
Опишіть два класи Base та його спадкоємця Child з методами method(), який виводить на консоль фрази 
відповідно "Hello from Base" та "Hello from Child".

Завдання 2 
Ознайомившись з кодом файлу example_7.py, створіть додаткові класи-нащадки Cone та Paraboloid від 
класу Shape. Перевизначте їх методи. Створіть екземпляри відповідних класів за скористайтеся всіма 
методами. В результаті повинно з’явитися зображення. Перегляньте їх. 

Завдання 3 
Створіть клас, який описує автомобіль. Які атрибути та методи мають бути повністю інкапсульовані? 
Доступ до таких атрибутів та зміну даних реалізуйте через спеціальні методи (get, set). 

Завдання 4 
Створіть 2 класи мови, наприклад, англійська та іспанська. В обох класів має бути метод greeting(). 
Обидва створюють різні привітання. Створіть два відповідні об'єкти з двох класів вище та викличте дії 
цих двох об'єктів в одній функції (функція hello_friend).

Завдання 5 
Використовуючи посилання наприкінці цього уроку, ознайомтеся з таким засобом інкапсуляції, як 
властивості. Ознайомтеся з декоратором property у Python. Створіть клас, що описує температуру і 
дозволяє задавати та отримувати температуру за шкалою Цельсія та Фаренгейта, причому дані можуть 
бути задані в одній шкалі, а отримані в іншій. 
"""